import pandas as pd
data = {
    'имя':['Ваня', 'Петя', 'Маша', 'Глаша', 'Рома', 'Степа', 'Тёма', 'Софи', 'Аня','Егор'],
    'Математика': [5, 5, 4, 5, 5, 4, 5, 1, 5, 4],
    'Физика': [4, 5, 4, 5, 3, 4, 4, 4, 3, 2],
    'Химия': [3, 4, 5, 4, 2, 3, 3, 3, 4, 3],
    'Биология': [2, 3, 3, 3, 2, 1, 2, 4, 5, 4],
    'История': [5, 3, 3, 3, 4, 5, 5, 4, 4, 5],
}
#index_names = ['Ваня', 'Петя', 'Маша', 'Глаша', 'Рома', 'Степа', 'Тёма', 'Софи', 'Аня','Егор']
df = pd.DataFrame(data)
print(df.head())
#print(df.describe())

print(f"\nМатематика. Средняя оценка - {df['Математика'].mean()}")
print(f"Физика. Средняя оценка - {df['Физика'].mean()}")
print(f"Химия. Средняя оценка - {df['Химия'].mean()}")
print(f"Биология. Средняя оценка - {df['Биология'].mean()}")
print(f"История. Средняя оценка - {df['История'].mean()}")

print(f"\nМатематика. Медианная оценка - {df['Математика'].median()}")
print(f"Физика. Медианная оценка - {df['Физика'].median()}")
print(f"Химия. Медианная оценка - {df['Химия'].median()}")
print(f"Биология. Медианная оценка - {df['Биология'].median()}")
print(f"История. Медианная оценка - {df['История'].median()}")

Q1 = df['Математика'].quantile(0.25)
Q3 = df['Математика'].quantile(0.75)
print(f'\nПервый квартиль - {Q1}')
print(f'Третий квартиль - {Q3}')
IQR = Q3 - Q1
print(f'Межквартильный размах - {IQR}')

print(f"\nМатематика. Стандартное отклонение  - {df['Математика'].std()}")
print(f"Физика. Стандартное отклонение  - {df['Физика'].std()}")
print(f"Химия. Стандартное отклонение  - {df['Химия'].std()}")
print(f"Биология. Стандартное отклонение  - {df['Биология'].std()}")
print(f"История. Стандартное отклонение  - {df['История'].std()}")